package com.cora.fastbi.strategy;

import org.junit.jupiter.api.Test;
import org.springframework.boot.test.context.SpringBootTest;

@SpringBootTest
class BaiduAppStrategyTest {

    @Test
    void AIQuestion() {
        AIStrategy aiStrategy = new BaiduAppStrategy();
        aiStrategy.AIQuestion("你是一个专业数据分析师和前端开发专家，接下来我会按照以下固定格式给你提供内容：\n" +
                "分析需求：\n" +
                "{数据分析的需求或者目标}\n" +
                "原始数据：\n" +
                "{csv格式的原始数据，用','作为分隔符，用'\\n'作为换行符}\n" +
                "请根据以上内容，按照指定格式生成以下两部分内容（注意需要生成两部分内容）\n" +
                "第一部分：\n" +
                "{前端Echarts V5的option配置对象json代码，将数据进行可视化，不要生成任何注释}\n" +
                "第二部分：\n" +
                "{给出详细明确的数据分析结论，以及通过数据分析给出的建议，注意这部分不能省略}以下是第一部分json代码的示例，请按示例格式生成{\n" +
                "    \"xAxis\": {\n" +
                "      \"type\": \"category\",\n" +
                "      \"data\": [\"2022/1/1\", \"2022/2/2\", \"2022/3/3\", \"2022/4/4\", \"2022/5/5\", \"2022/6/30\", \"2022/7/1\", \"2022/9/3\", \"2022/10/4\", \"2022/11/5\", \"2022/12/31\"]\n" +
                "    },\n" +
                "    \"yAxis\": {\n" +
                "      \"type\": \"value\"\n" +
                "    }}分析需求：\n" +
                "分析该网站的用户变化数据，请使用图表类型：折线图\n" +
                "原始数据：\n" +
                "日期,访问量,用户数\n" +
                "2022/1/1,1000,500\n" +
                "2022/2/2,1200,550\n" +
                "2022/3/3,900,480\n" +
                "2022/4/4,1100,520\n" +
                "2022/5/5,1300,570\n" +
                "2022/6/30,1500,650\n" +
                "2022/7/1,1600,680\n" +
                "2022/9/3,1400,650\n" +
                "2022/10/4,1800,750\n" +
                "2022/11/5,1900,800\n" +
                "2022/12/31,2000,850\n");
    }
}